vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/FLASH_registers.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the FLASH register type definitions for the stm32h503 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "FLASH_index.h"


typedef union {
	struct {
		uint32_t LATENCY       : 4; // /*!< Latency    */
		uint32_t WRHIGHFREQ    : 2; // /*!< Flash signal delay */
		uint32_t _reserved6    : 2;
		uint32_t PRFTEN        : 1; // /*!< Prefetch enable */
		uint32_t _reserved9    :23;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,acr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,acr),bits);

typedef union {
	struct {
		uint32_t KEY           :32; // Key
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,optkeyr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,optkeyr),bits);

typedef union {
	struct {
		uint32_t ADDR_OP       :20; // /*!< Interrupted operation address */
		uint32_t _reserved20   : 2;
		uint32_t BK_OP         : 1; // /*!< Interrupted operation bank */
		uint32_t SYSF_OP       : 1; // /*!< Operation in System Flash interrupted */
		uint32_t OTP_OP        : 1; // /*!< Operation in OTP area interrupted */
		uint32_t _reserved25   : 4;
		uint32_t CODE_OP       : 3; // /*!< Flash memory operation code */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,opsr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,opsr),bits);

typedef union {
	struct {
		uint32_t OPTLOCK       : 1; // /*!< FLASH_OPTCR lock option configuration bit */
		uint32_t OPTSTART      : 1; // /*!< Option byte start change option configuration bit */
		uint32_t _reserved2    :29;
		uint32_t SWAP_BANK     : 1; // /*!< Bank swapping option configuration bit */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,optcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,optcr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 1;
		uint32_t NSPRIV        : 1; // /*!< Privilege protection for non-secure registers */
		uint32_t _reserved2    :30;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,privcfgr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,privcfgr),bits);

typedef union {
	struct {
		uint32_t HDP1_EXT      : 3; // /*!< HDP area extension in 8kB sectors in bank 1 */
		uint32_t _reserved3    :13;
		uint32_t HDP2_EXT      : 3; // /*!< HDP area extension in 8kB sectors in bank 2 */
		uint32_t _reserved19   :13;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,hdpextr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,hdpextr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,optsr_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,optsr_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,nsepochr_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,nsepochr_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,nsepochr_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,nsepochr_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,optsr2_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,optsr2_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,nsbootr_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,nsbootr_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,nsbootr_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,nsbootr_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,otpblr_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,otpblr_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,otpblr_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,otpblr_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,privbb1r1);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,privbb1r1),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,wrp1r_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,wrp1r_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,wrp1r_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,wrp1r_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,hdp1r_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,hdp1r_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,hdp1r_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,hdp1r_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,ecccorr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,ecccorr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,eccdetr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,eccdetr),bits);

typedef union {
	struct {
		uint32_t FAIL_DATA     :16; // /*!< ECC fail data */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,eccdr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,eccdr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,privbb2r1);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,privbb2r1),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,wrp2r_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,wrp2r_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,wrp2r_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,wrp2r_prg),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,hdp2r_cur);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,hdp2r_cur),bits);

typedef union {
	struct {
		uint32_t _reserved0    :32;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,hdp2r_prg);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,hdp2r_prg),bits);

typedef union {
	struct {
		uint32_t LOCK          : 1; // /*!< Configuration lock bit */
		uint32_t PG            : 1; // /*!< Programming control bit */
		uint32_t SER           : 1; // /*!< Sector erase request */
		uint32_t BER           : 1; // /*!< Bank erase request */
		uint32_t FW            : 1; // /*!< Write forcing control bit */
		uint32_t START         : 1; // /*!< Erase start control bit */
		uint32_t SNB           : 7; // /*!< Sector erase selection number */
		uint32_t _reserved13   : 2;
		uint32_t MER           : 1; // /*!< Mass erase */
		uint32_t EOPIE         : 1; // /*!< End-of-operation interrupt control bit */
		uint32_t WRPERRIE      : 1; // /*!< Write protection error interrupt enable bit */
		uint32_t PGSERRIE      : 1; // /*!< Programming sequence error interrupt enable bit */
		uint32_t STRBERRIE     : 1; // /*!< Strobe error interrupt enable bit */
		uint32_t INCERRIE      : 1; // /*!< Inconsistency error interrupt enable bit */
		uint32_t _reserved21   : 2;
		uint32_t OPTCHANGEERRIE: 1; // /*!< Option byte change error interrupt enable bit */
		uint32_t _reserved24   : 5;
		uint32_t INV           : 1; // /*!< Flash Security State Invert */
		uint32_t _reserved30   : 1;
		uint32_t BKSEL         : 1; // /*!< Bank selector */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,cr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,cr),bits);

typedef union {
	struct {
		uint32_t BSY           : 1; // /*!< Busy flag */
		uint32_t WBNE          : 1; // /*!< Write buffer not empty flag */
		uint32_t _reserved2    : 1;
		uint32_t DBNE          : 1; // /*!< Data buffer not empty flag */
		uint32_t _reserved4    :12;
		uint32_t EOP           : 1; // /*!< End-of-program flag */
		uint32_t WRPERR        : 1; // /*!< Write protection error flag */
		uint32_t PGSERR        : 1; // /*!< Programming sequence error flag */
		uint32_t STRBERR       : 1; // /*!< Strobe error flag */
		uint32_t INCERR        : 1; // /*!< Inconsistency error flag */
		uint32_t _reserved21   : 2;
		uint32_t OPTCHANGEERR  : 1; // /*!< Option byte change error flag */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,sr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,sr),bits);

typedef union {
	struct {
		uint32_t KEY           :32; // Key
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,keyr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,keyr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t CLR_EOP       : 1; // /*!< EOP flag clear bit */
		uint32_t CLR_WRPERR    : 1; // /*!< WRPERR flag clear bit */
		uint32_t CLR_PGSERR    : 1; // /*!< PGSERR flag clear bit */
		uint32_t CLR_STRBERR   : 1; // /*!< STRBERR flag clear bit */
		uint32_t CLR_INCERR    : 1; // /*!< INCERR flag clear bit */
		uint32_t _reserved21   : 2;
		uint32_t CLR_OPTCHANGEERR: 1; // /*!< Option byte change error clear bit */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,ccr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,ccr),bits);

typedef union {
	struct {
		uint32_t BOR_LEV       : 2; // /*!< Brownout level option bit */
		uint32_t BORH_EN       : 1; // /*!< Brownout high enable configuration bit */
		uint32_t IWDG_SW       : 1; // /*!< IWDG control mode option bit */
		uint32_t WWDG_SW       : 1; // /*!< WWDG control mode option bit */
		uint32_t _reserved5    : 1;
		uint32_t NRST_STOP     : 1; // /*!< Stop mode entry reset option bit */
		uint32_t NRST_STDBY    : 1; // /*!< Standby mode entry reset option bit */
		uint32_t PRODUCT_STATE : 8; // /*!< Life state code option byte */
		uint32_t IO_VDD_HSLV   : 1; // /*!< VDD I/O high-speed at low-voltage option bit */
		uint32_t IO_VDDIO2_HSLV: 1; // /*!< VDDIO2 I/O high-speed at low-voltage option bit */
		uint32_t _reserved18   : 2;
		uint32_t IWDG_STOP     : 1; // /*!< Independent watchdog counter freeze in Stop mode */
		uint32_t IWDG_STDBY    : 1; // /*!< Independent watchdog counter freeze in Standby mode */
		uint32_t _reserved22   : 9;
		uint32_t SWAP_BANK     : 1; // /*!< Bank swapping option bit */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,optsr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,optsr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 3;
		uint32_t SRAM2_RST     : 1; // /*!< SRAM2 erased when a system reset occurs*/
		uint32_t BKPRAM_ECC    : 1; // /*!< Backup RAM ECC detection and correction enable */
		uint32_t _reserved5    : 1;
		uint32_t SRAM2_ECC     : 1; // /*!< SRAM2 ECC detection and correction disable */
		uint32_t _reserved7    : 2;
		uint32_t SRAM1_RST     : 1; // /*!< SRAM1 erase upon a system reset */
		uint32_t SRAM1_ECC     : 1; // /*!< SRAM1 ECC detection and correction disable */
		uint32_t _reserved11   :21;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_flash,optsr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_flash,optsr2),bits);

static const stm32_reginfo_t stm32_h503_flash_reginfo[RI_END] =
{
	[RI_ACR            ] = { .reset_val = 0x00000013, .not_reserved = true, .unimp_mask = 0x00000130, .mask = 0x0000013F }, /* mask = 0b00000000000000000000000100111111 */
	[RI_KEYR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_OPTKEYR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_OPSR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xE1CFFFFF, .mask = 0xE1CFFFFF }, /* mask = 0b11100001110011111111111111111111 */
	[RI_OPTCR          ] = { .reset_val = 0x00000001, .not_reserved = true, .unimp_mask = 0x80000003, .mask = 0x80000003 }, /* mask = 0b10000000000000000000000000000011 */
	[RI_SR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x009F000B, .mask = 0x009F000B }, /* mask = 0b00000000100111110000000000001011 */
	[RI_CR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xA09F9FFF, .mask = 0xA09F9FFF }, /* mask = 0b10100000100111111001111111111111 */
	[RI_CCR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x009F0000, .mask = 0x009F0000 }, /* mask = 0b00000000100111110000000000000000 */
	[RI_PRIVCFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000002, .mask = 0x00000002 }, /* mask = 0b00000000000000000000000000000010 */
	[RI_HDPEXTR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00070007, .mask = 0x00070007 }, /* mask = 0b00000000000001110000000000000111 */
	[RI_OPTSR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x8033FFDF, .mask = 0x8033FFDF }, /* mask = 0b10000000001100111111111111011111 */
	[RI_OPTSR_PRG      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_EPOCHR_CUR     ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_EPOCHR_PRG     ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_OPTSR2         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000658, .mask = 0x00000658 }, /* mask = 0b00000000000000000000011001011000 */
	[RI_OPTSR2_PRG     ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_BOOTR_CUR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_BOOTR_PRG      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_OTPBLR_CUR     ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_OTPBLR_PRG     ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_PRIVBB1R1      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_WRP1R_CUR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_WRP1R_PRG      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_HDP1R_CUR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_HDP1R_PRG      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ECCCORR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ECCDETR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ECCDR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000FFFF, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_PRIVBB2R1      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_WRP2R_CUR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_WRP2R_PRG      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_HDP2R_CUR      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_HDP2R_PRG      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
};

typedef union {
	struct {
		REGDEF_NAME(h503_flash,acr) ACR;
		REGDEF_NAME(h503_flash,keyr) KEYR;
		uint32_t _reserved0x8;
		REGDEF_NAME(h503_flash,optkeyr) OPTKEYR;
		uint32_t _reserved0x10[ 2];
		REGDEF_NAME(h503_flash,opsr) OPSR;
		REGDEF_NAME(h503_flash,optcr) OPTCR;
		REGDEF_NAME(h503_flash,sr) SR;
		uint32_t _reserved0x24;
		REGDEF_NAME(h503_flash,cr) CR;
		uint32_t _reserved0x2C;
		REGDEF_NAME(h503_flash,ccr) CCR;
		uint32_t _reserved0x34[ 2];
		REGDEF_NAME(h503_flash,privcfgr) PRIVCFGR;
		uint32_t _reserved0x40[ 2];
		REGDEF_NAME(h503_flash,hdpextr) HDPEXTR;
		uint32_t _reserved0x4C;
		REGDEF_NAME(h503_flash,optsr) OPTSR;
		REGDEF_NAME(h503_flash,optsr_prg) OPTSR_PRG;
		uint32_t _reserved0x58[ 2];
		REGDEF_NAME(h503_flash,nsepochr_cur) NSEPOCHR_CUR;
		REGDEF_NAME(h503_flash,nsepochr_prg) NSEPOCHR_PRG;
		uint32_t _reserved0x68[ 2];
		REGDEF_NAME(h503_flash,optsr2) OPTSR2;
		REGDEF_NAME(h503_flash,optsr2_prg) OPTSR2_PRG;
		uint32_t _reserved0x78[ 2];
		REGDEF_NAME(h503_flash,nsbootr_cur) NSBOOTR_CUR;
		REGDEF_NAME(h503_flash,nsbootr_prg) NSBOOTR_PRG;
		uint32_t _reserved0x88[ 2];
		REGDEF_NAME(h503_flash,otpblr_cur) OTPBLR_CUR;
		REGDEF_NAME(h503_flash,otpblr_prg) OTPBLR_PRG;
		uint32_t _reserved0x98[10];
		REGDEF_NAME(h503_flash,privbb1r1) PRIVBB1R1;
		uint32_t _reserved0xC4[ 9];
		REGDEF_NAME(h503_flash,wrp1r_cur) WRP1R_CUR;
		REGDEF_NAME(h503_flash,wrp1r_prg) WRP1R_PRG;
		uint32_t _reserved0xF0[ 2];
		REGDEF_NAME(h503_flash,hdp1r_cur) HDP1R_CUR;
		REGDEF_NAME(h503_flash,hdp1r_prg) HDP1R_PRG;
		REGDEF_NAME(h503_flash,ecccorr) ECCCORR;
		REGDEF_NAME(h503_flash,eccdetr) ECCDETR;
		REGDEF_NAME(h503_flash,eccdr) ECCDR;
		uint32_t _reserved0x10C[45];
		REGDEF_NAME(h503_flash,privbb2r1) PRIVBB2R1;
		uint32_t _reserved0x1C4[ 9];
		REGDEF_NAME(h503_flash,wrp2r_cur) WRP2R_CUR;
		REGDEF_NAME(h503_flash,wrp2r_prg) WRP2R_PRG;
		uint32_t _reserved0x1F0[ 2];
		REGDEF_NAME(h503_flash,hdp2r_cur) HDP2R_CUR;
		REGDEF_NAME(h503_flash,hdp2r_prg) HDP2R_PRG;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(h503,flash);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(h503,flash)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), ACR) != 0, "Offset mismatch for ACR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPTKEYR) != 12, "Offset mismatch for OPTKEYR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPSR) != 24, "Offset mismatch for OPSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPTCR) != 28, "Offset mismatch for OPTCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), PRIVCFGR) != 60, "Offset mismatch for PRIVCFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), HDPEXTR) != 72, "Offset mismatch for HDPEXTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPTSR_PRG) != 84, "Offset mismatch for OPTSR_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), NSEPOCHR_CUR) != 96, "Offset mismatch for NSEPOCHR_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), NSEPOCHR_PRG) != 100, "Offset mismatch for NSEPOCHR_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPTSR2_PRG) != 116, "Offset mismatch for OPTSR2_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), NSBOOTR_CUR) != 128, "Offset mismatch for NSBOOTR_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), NSBOOTR_PRG) != 132, "Offset mismatch for NSBOOTR_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OTPBLR_CUR) != 144, "Offset mismatch for OTPBLR_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OTPBLR_PRG) != 148, "Offset mismatch for OTPBLR_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), PRIVBB1R1) != 192, "Offset mismatch for PRIVBB1R1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), WRP1R_CUR) != 232, "Offset mismatch for WRP1R_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), WRP1R_PRG) != 236, "Offset mismatch for WRP1R_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), HDP1R_CUR) != 248, "Offset mismatch for HDP1R_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), HDP1R_PRG) != 252, "Offset mismatch for HDP1R_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), ECCCORR) != 256, "Offset mismatch for ECCCORR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), ECCDETR) != 260, "Offset mismatch for ECCDETR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), ECCDR) != 264, "Offset mismatch for ECCDR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), PRIVBB2R1) != 448, "Offset mismatch for PRIVBB2R1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), WRP2R_CUR) != 488, "Offset mismatch for WRP2R_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), WRP2R_PRG) != 492, "Offset mismatch for WRP2R_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), HDP2R_CUR) != 504, "Offset mismatch for HDP2R_CUR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), HDP2R_PRG) != 508, "Offset mismatch for HDP2R_PRG");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), CR) != 40, "Offset mismatch for CR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), SR) != 32, "Offset mismatch for SR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), KEYR) != 4, "Offset mismatch for KEYR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), CCR) != 48, "Offset mismatch for CCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPTSR) != 80, "Offset mismatch for OPTSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,flash), OPTSR2) != 112, "Offset mismatch for OPTSR2");
